
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Попытка
			Об=СсылкаНаОбъект.ПолучитьОбъект();
			Инициализировать(Об,ТабличнаяЧасть,"");
			Об.ПолучитьФорму().Открыть();
		Исключение
			Сообщить("Произошли ошибки "+Символы.ПС+ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура СсылкаНаОбъектПриИзменении(Элемент)
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) ИЛИ
		Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		ЭлементыФормы.ИмяТабличнойЧасти.СписокВыбора.Очистить();
		Для Каждого Мета Из СсылкаНаОбъект.Метаданные().ТабличныеЧасти Цикл
			ЭлементыФормы.ИмяТабличнойЧасти.СписокВыбора.Добавить(Мета.Имя);
		КонецЦикла;
		Если ЭлементыФормы.ИмяТабличнойЧасти.СписокВыбора.Количество() Тогда
			ТабличнаяЧасть=ЭлементыФормы.ИмяТабличнойЧасти.СписокВыбора.Получить(0).Значение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
